=======================================================
valid identifier: #1
=======================================================

select _5abc.dataField

--------------------------------------------------------------------------------

(source_file
 (select_statement
  (select_clause
   (select_clause_body
    (identifier)))))

=======================================================
valid identifier: #2
=======================================================

select `5abc`.dataField

--------------------------------------------------------------------------------

(source_file
 (select_statement
  (select_clause
   (select_clause_body
    (identifier)))))

=======================================================
valid identifier: #3
=======================================================

select `GROUP`.dataField

--------------------------------------------------------------------------------

(source_file
 (select_statement
  (select_clause
   (select_clause_body
    (identifier)))))


=======================================================
valid identifier: #4
=======================================================

select abc5.GROUP

--------------------------------------------------------------------------------

(source_file
 (select_statement
  (select_clause
   (select_clause_body
    (identifier)))))

