================================================================================
SELECT statement with bigquery public dataset
================================================================================

SELECT * FROM `bigquery-public-data.austin_311.311_service_requests` LIMIT 1000

--------------------------------------------------------------------------------

(source_file 
  (select_statement 
    (select_clause 
      (select_clause_body (asterisk_expression)))
    (from_clause (from_item (identifier)))
    (limit_clause)))

================================================================================
SELECT statement with joins
================================================================================

SELECT a, t.a, t.b
FROM table1 AS t
JOIN t1 ON (t.a = t1.a)
INNER JOIN t2 ON (t.a = t2.a)
CROSS JOIN t3 ON t.a = t2.a
FULL OUTER JOIN t2 ON t.a = t2.a
FULL JOIN t3 ON t.a = t3.a
RIGHT JOIN t4 ON t.a = t4.a
RIGHT OUTER JOIN t5 ON t.a = t5.a
LEFT JOIN t6 ON t.a = t6.a
LEFT OUTER JOIN t7 ON t.a = t7.a;

--------------------------------------------------------------------------------

(source_file
(select_statement
  (select_clause
    (select_clause_body
      (identifier)
      (identifier)
      (identifier)))
  (from_clause
    (from_item
      (join_operation
        (from_item
          (join_operation
            (from_item
              (join_operation
                (from_item
                  (join_operation
                    (from_item
                      (join_operation
                        (from_item
                          (join_operation
                            (from_item
                              (join_operation
                                (from_item
                                  (join_operation
                                    (from_item
                                      (join_operation
                                        (from_item
                                          (identifier)
                                          (as_alias
                                            (identifier)))
                                        (from_item
                                          (identifier))
                                        (binary_expression
                                          (identifier)
                                          (identifier))))
                                    (join_type)
                                    (from_item
                                      (identifier))
                                    (binary_expression
                                      (identifier)
                                      (identifier))))
                                (from_item
                                  (identifier)
                                  (as_alias
                                    (identifier)))))
                            (ERROR)
                            (join_type)
                            (from_item
                              (identifier))
                            (binary_expression
                              (identifier)
                              (identifier))))
                        (join_type)
                        (from_item
                          (identifier))
                        (binary_expression
                          (identifier)
                          (identifier))))
                    (join_type)
                    (from_item
                      (identifier))
                    (binary_expression
                      (identifier)
                      (identifier))))
                (join_type)
                (from_item
                  (identifier))
                (binary_expression
                  (identifier)
                  (identifier))))
            (join_type)
            (from_item
              (identifier))
            (binary_expression
              (identifier)
              (identifier))))
        (join_type)
        (from_item
          (identifier))
        (binary_expression
          (identifier)
          (identifier)))))))


================================================================================
SELECT element from array
================================================================================

SELECT a[0];

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (array_element_access
          (identifier)
          (number))))))

================================================================================
SELECT with cross join
================================================================================

SELECT a as b, c d, e
FROM table1 AS t, table2 t2, table3

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (alias
          (identifier)
          (identifier))
        (alias
          (identifier)
          (identifier))
        (identifier)))
    (from_clause
      (from_item
        (join_operation
          (from_item
            (join_operation
              (from_item
                (identifier)
                (as_alias
                  (identifier)))
              (from_item
                (identifier)
                (as_alias
                  (identifier)))))
          (from_item
            (identifier)))))))

================================================================================
SELECT with CTE
================================================================================

with cte1 as (
  select 1 as a
)
, cte2 as (
  select * from cte1
)

select * from cte2

--------------------------------------------------------------------------------


(source_file
  (select_statement
    (cte_clause
      (identifier)
      (select_clause_body
        (select_subexpression
          (select_statement
            (select_clause
              (select_clause_body
                (alias
                  (number)
                  (identifier)))))))
      (identifier)
      (select_clause_body
        (select_subexpression
          (select_statement
            (select_clause
              (select_clause_body
                (asterisk_expression)))
            (from_clause
              (from_item (identifier)))))))
    (select_clause
      (select_clause_body
        (asterisk_expression)))
    (from_clause
      (from_item (identifier)))))

================================================================================
SELECT statement
================================================================================

SELECT;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause)))

================================================================================
SELECT statement with distinct expression
================================================================================

SELECT 1 IS DISTINCT FROM NULL;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (binary_expression
          (number)
          (NULL))))))

================================================================================
SELECT statement FROM clause
================================================================================

SELECT a, b FROM table1;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (from_item (identifier)))))

================================================================================
SELECT statement with SELECT subexpression
================================================================================

SELECT (SELECT 1) AS a

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (alias
          (select_subexpression
            (select_statement
              (select_clause
                (select_clause_body
                  (number)))))
          (identifier))))))

================================================================================
SELECT statement with aliases
================================================================================

SELECT a, b AS c FROM table1 AS t;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (alias
          (identifier)
          (identifier))))
    (from_clause
      (from_item
        (identifier)
        (as_alias
          (identifier))))))

================================================================================
SELECT statement with group by
================================================================================

SELECT a, b
FROM table1
GROUP BY lower(a), b;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (from_item (identifier)))
    (group_by_clause
      (group_by_clause_body
        (function_call
          (identifier)
          (identifier))
        (identifier)))))

================================================================================
SELECT statement with order by
================================================================================

SELECT a, b
FROM table1
ORDER BY lower(a), b;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (from_item (identifier)))
    (order_by_clause
      (order_by_clause_body
        (function_call
          (identifier)
          (identifier))
        (identifier)))))

================================================================================
SELECT statement FROM multiple tables
================================================================================

SELECT a, b FROM table1, table2;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
     (from_item 
      (join_operation 
        (from_item (identifier))
        (from_item (identifier)))))))

================================================================================
SELECT statement with numbers
================================================================================

SELECT 1, 2;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (number)
        (number)))))

================================================================================
SELECT statement with expression
================================================================================

SELECT 1 + 2;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (binary_expression
          (number)
          (number))))))

================================================================================
SELECT statement with empty string
================================================================================

SELECT '';

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (string)))))

================================================================================
SELECT statement with columns
================================================================================

SELECT a, b;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))))



================================================================================
SELECT string
================================================================================

SELECT 'aaaa'

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (string)))))


================================================================================
Can parse subquery
================================================================================

SELECT id
FROM foo
WHERE id < (
  SELECT id
  FROM bar
  LIMIT 1 OFFSET 0
);

---

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)))
    (from_clause
      (from_item (identifier)))
    (where_clause
      (binary_expression
        (identifier)
        (select_subexpression
          (select_statement
            (select_clause
              (select_clause_body
                (identifier)))
            (from_clause
              (from_item (identifier)))
            (limit_clause))
            )))))

================================================================================
SELECT asterisk expressions
================================================================================

SELECT * FROM Customers;
SELECT a.* FROM Customers;
SELECT COUNT(*) FROM Customers;
SELECT COUNT(a.*) FROM Customers;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (asterisk_expression)))
    (from_clause
      (from_item (identifier))))
  (select_statement
    (select_clause
      (select_clause_body
        (asterisk_expression)))
    (from_clause
      (from_item (identifier))))
  (select_statement
    (select_clause
      (select_clause_body
        (function_call
          (identifier)
          (asterisk_expression))))
    (from_clause
      (from_item (identifier))))
  (select_statement
    (select_clause
      (select_clause_body
        (function_call
          (identifier)
          (asterisk_expression))))
    (from_clause
      (from_item (identifier)))))

 
================================================================================
UNNEST
================================================================================

select * from unnest([1, 2, 3]);
select * from unnest([]) as hoge with offset;
select * from unnest(field_path) as hoge with offset;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (asterisk_expression)))
    (from_clause
     (from_item (unnest_clause
       (unnest_operator
        (array
         (number)
         (number)
         (number)))))))
 (select_statement
  (select_clause
   (select_clause_body
    (asterisk_expression)))
  (from_clause
   (from_item 
    (unnest_clause
     (unnest_operator (array))
     (identifier)
     (unnest_withoffset)))))
 (select_statement
  (select_clause
   (select_clause_body
    (asterisk_expression)))
  (from_clause
   (from_item 
      (unnest_clause
      (unnest_operator)
      (identifier)
      (unnest_withoffset)))
   ))
 )

================================================================================
TABLESAMPLE operator
================================================================================

SELECT * FROM dataset.my_table TABLESAMPLE SYSTEM (10 PERCENT)

--------------------------------------------------------------------------------

(source_file
    (select_statement
    (select_clause
        (select_clause_body
        (asterisk_expression)))
    (from_clause
      (from_item
        (identifier))
        (tablesample_operator))))

==================
One cte
==================

WITH my_cte AS (
  SELECT one, two
  FROM my_table
)
SELECT *
FROM my_cte;

---

(source_file
    (select_statement
    (cte_clause
        (identifier)
        (select_clause_body
        (select_subexpression
            (select_statement
            (select_clause
                (select_clause_body
                (identifier)
                (identifier)))
            (from_clause
                (from_item (identifier)))))))
    (select_clause
        (select_clause_body
        (asterisk_expression)))
    (from_clause
      (from_item (identifier)))))

